conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/InformationRegisters/ЭП_КомпетенцииСотрудников/ЭП_КомпетенцииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КомпетенцииСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКомпетенции</name>
    <type>
      <types>CatalogRef.ЭП_ВидыКомпетенцийСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_СобытияСотрудников/ЭП_СобытияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_СобытияСотрудников</name>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ЭП_ВидыСобытийСотрудников</types>
      <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_СтатусыСотрудников/ЭП_СтатусыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусыСотрудников</name>
  <enumValues>
    <name>ИспытательныйСрок</name>
  </enumValues>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
  <enumValues>
    <name>ВременноНеРаботает</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЭП_Сотрудники/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИсходныйТекстЗапроса = Список.ТекстЗапроса;
	ГлубинаСобытий = 7; // дней
	СкрытьУволенных(); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьСписокСотрудников();
КонецПроцедуры


#КонецОбласти

#Область СобытияЭлементовДиалога

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПоказатьСобытияСотрудника(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаСобытийПриИзменении(Элемент)
	НастроитьСписокСотрудников();
	ПоказатьСобытияСотрудника(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокКомпетенцийПриИзменении(Элемент)
	УстановитьТекстЗапросаСписка();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВключитьОтборНажатие(Команда)
	
	Если Не ОтборПоКомпетенциям 
		И ТаблицаКомпетенций.Количество() = 0 Тогда // Попытка включить отбор без настроек
		ПоказатьПредупреждение(,"Не заполнен отбор компетенций!",3);
		Возврат;
	КонецЕсли;
	
	ОтборПоКомпетенциям = Не ОтборПоКомпетенциям;
	Элементы.ВключитьОтбор.Пометка = ОтборПоКомпетенциям;
	Если ОтборПоКомпетенциям Тогда
		Элементы.ВключитьОтбор.Заголовок = "Отключить отбор";
	Иначе
		Элементы.ВключитьОтбор.Заголовок = "Включить отбор";
	КонецЕсли;
		
	УстановитьТекстЗапросаСписка();

КонецПроцедуры

#КонецОбласти


#Область Служебные

&НаСервере
Процедура НастроитьСписокСотрудников()

	Список.Параметры.УстановитьЗначениеПараметра("ДатаСобытия", ТекущаяДата() + ГлубинаСобытий*86400);

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаСписка()
	
	ПараметрыЗапроса = Новый Структура;

	Если Не ОтборПоКомпетенциям Тогда
		ТекстЗапроса = ИсходныйТекстЗапроса;
	Иначе
		ТекстЗапроса = ТекстЗапросаОтборПоКомпетенциям(ПараметрыЗапроса);
	КонецЕсли;

	Список.ТекстЗапроса = ТекстЗапроса;
	
	Для Каждого КлючЗначение Из ПараметрыЗапроса Цикл
		Список.Параметры.УстановитьЗначениеПараметра(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	Если ОтборПоКомпетенциям Тогда
		ДобавитьЭлементПорядка(Порядок, "Рейтинг", Истина);
	КонецЕсли;
	ДобавитьЭлементПорядка(Порядок, "Наименование");

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОтборПоКомпетенциям(ПараметрыЗапроса)
	
	ТекстЗапроса = "";  

	// Построение текста запроса на основе таблицы компетенций
	// (невозможно передать таблицу значений в динамический список, поэтому формируется текст запроса с построчным вводом значений
	// На практике их не должно быть много - одна-две строчки, как правило. Можно ограничить максимальное количество строк таблицы значением 5.
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	&ВидКомпетенцииИндекс КАК ВидКомпетенции,
	|	&ЗначениеИндекс КАК Значение,
	|	&ВесовойКоэффициентИндекс КАК ВесовойКоэффициент";

	ОбъединениеЗапроса = 
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ПерваяСтрока = Истина;
	ВесовойКоэффициент = pow(10, ТаблицаКомпетенций.Количество()-1);
	Для Каждого СтрокаКомпетенций Из ТаблицаКомпетенций Цикл 
		Если Не ПерваяСтрока Тогда
			ТекстЗапроса = ТекстЗапроса + ОбъединениеЗапроса;
		КонецЕсли;
		
		Индекс = Формат(ТаблицаКомпетенций.Индекс(СтрокаКомпетенций),"ЧГ=0");
		ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ШаблонЗапроса, "Индекс", Индекс);
		
		Если ПерваяСтрока Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ПОМЕСТИТЬ ТаблицаКомпетенций";
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("ВидКомпетенции" + Индекс, СтрокаКомпетенций.ВидКомпетенции);
		ПараметрыЗапроса.Вставить("Значение" + Индекс, СтрокаКомпетенций.Значение);
		ПараметрыЗапроса.Вставить("ВесовойКоэффициент" + Индекс, ВесовойКоэффициент);
		
		ПерваяСтрока = Ложь;
		Если ВесовойКоэффициент > 1 Тогда
			ВесовойКоэффициент = ВесовойКоэффициент / 10;
		КонецЕсли;
	КонецЦикла;
	
	// Получение рейтинга сотрудников на основании таблицы компетенций
	РазделительЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + РазделительЗапроса + 
	"ВЫБРАТЬ
	|	ЭП_Сотрудники.Ссылка КАК Сотрудник,
	|	ТаблицаКомпетенций.ВидКомпетенции КАК ВидКомпетенции,
	|	ТаблицаКомпетенций.Значение КАК Значение,
	|	ТаблицаКомпетенций.ВесовойКоэффициент КАК ВесовойКоэффициент
	|ПОМЕСТИТЬ СеткаСотрудников
	|ИЗ
	|	Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники,
	|	ТаблицаКомпетенций КАК ТаблицаКомпетенций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СеткаСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ЕСТЬNULL(ЭП_Компетенции.Значение, 0) * СеткаСотрудников.ВесовойКоэффициент) КАК Рейтинг
	|ПОМЕСТИТЬ РейтингСотрудников
	|ИЗ
	|	СеткаСотрудников КАК СеткаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_КомпетенцииСотрудников.СрезПоследних(
	|				,
	|				ВидКомпетенции В
	|					(ВЫБРАТЬ
	|						ТаблицаКомпетенций.ВидКомпетенции
	|					ИЗ
	|						ТаблицаКомпетенций)) КАК ЭП_Компетенции
	|		ПО СеткаСотрудников.Сотрудник = ЭП_Компетенции.Сотрудник
	|			И СеткаСотрудников.ВидКомпетенции = ЭП_Компетенции.ВидКомпетенции
	|
	|СГРУППИРОВАТЬ ПО
	|	СеткаСотрудников.Сотрудник
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЕСТЬNULL(ЭП_Компетенции.Значение, 0) >= СеткаСотрудников.Значение) = ИСТИНА";
	
	ТекстЗапроса = ТекстЗапроса + РазделительЗапроса + ИсходныйТекстЗапроса;
	
	// Добавить внутреннее соединение и установить поле "Рейтинг"
	ТекстЗапроса = ТекстЗапроса + "
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РейтингСотрудников КАК РейтингСотрудников
	|		ПО СправочникЭП_Сотрудники.Ссылка = РейтингСотрудников.Сотрудник";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"0 КАК Рейтинг","РейтингСотрудников.Рейтинг КАК Рейтинг");
	
	Возврат ТекстЗапроса;

КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьЭлементПорядка(Порядок,ИмяПоля,ПоУбыванию = Ложь)

	ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементПорядка.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	ЭлементПорядка.ТипУпорядочивания = ?(ПоУбыванию,НаправлениеСортировкиКомпоновкиДанных.Убыв,НаправлениеСортировкиКомпоновкиДанных.Возр);
	ЭлементПорядка.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ПоказатьСобытияСотрудника(ТекущийСотрудник)
	
	СобытияСотрудника = "";

	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_СобытияСотрудников.ДатаСобытия КАК ДатаСобытия,
	|	ЭП_СобытияСотрудников.ВидСобытия.Представление КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.ЭП_СобытияСотрудников КАК ЭП_СобытияСотрудников
	|ГДЕ
	|	ЭП_СобытияСотрудников.Сотрудник = &Сотрудник
	|	И ЭП_СобытияСотрудников.ДатаСобытия <= &ДатаСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия";
	
	Запрос.УстановитьПараметр("Сотрудник",ТекущийСотрудник);
	Запрос.УстановитьПараметр("ДатаСобытия", ТекущаяДата() + ГлубинаСобытий*86400);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Если Не ПустаяСтрока(СобытияСотрудника) Тогда
			СобытияСотрудника = СобытияСотрудника + "; ";
		КонецЕсли;
		СобытияСотрудника = СобытияСотрудника + Формат(ВыборкаЗапроса.ДатаСобытия,"ДФ=dd.MM.yyyy") + " " + ВыборкаЗапроса.ВидСобытия;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУволенных(Команда)
	
	Показать = Не Показать;	  
	Элементы.ПоказатьУволенных.Пометка = Показать;
	Если Показать Тогда
		Элементы.ПоказатьУволенных.Заголовок = "Скрыть уволенных";
		Список.Отбор.Элементы.Очистить();
	Иначе
		Элементы.ПоказатьУволенных.Заголовок = "Показать уволенных"; 
		СкрытьУволенных();
	КонецЕсли;      
	
КонецПроцедуры   

&НаСервере
Процедура СкрытьУволенных()

	Уволенные = Новый СписокЗначений; 
	Уволенные.Очистить();
	Уволенные.Добавить(Перечисления.ЭП_СтатусыСотрудников.Уволен);
	   
	Список.Отбор.Элементы.Очистить();
	НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусСотрудника");
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	НовЭлементОтбора.Использование = Истина;
	НовЭлементОтбора.ПравоеЗначение = Уволенные;	
			
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Копирование элементов не доступно, создайте новый элемент!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
